Autodesk.Revit.DB.ExternalDefinitionCreationOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.UserModifiable
This property indicates whether this parameter can be modified by UI user or not.
True if the parameter will be modifiable by the user in the user interface, false if the parameter will display as read-only.
The default is true.
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Description
The description of the parameter definition to be created. The description will be used as tooltip in the
Revit UI including in the properties palette.
The default is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GUID
The GUID to use for this parameter definition.
If not explicitly set, a random GUID is used.
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Visible
True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
The default is true.
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Type
The type of the parameter definition to be created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Name
The name of the parameter definition to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions.#ctor(System.String,Autodesk.Revit.DB.ParameterType)
Constructs the options using a specified name and type.
name:
The name of the parameter definition to be created.
type:
The name of the parameter type for the new definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ExternalDefinitionCreationOptions
An option class used for creating a new shared parameter definition, including options such as name, type, visibility,
Guid description and modifiable flag.
Since:
2015